Revit 2027 API
Form.AddEdge(Reference, XYZ) Method
Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddEdge(
	Reference faceReference,
	XYZ point
)
Public Sub AddEdge (
	faceReference As Reference,
	point As XYZ
)
public:
void AddEdge(
	Reference^ faceReference,
	XYZ^ point
)
member AddEdge :
        faceReference : Reference *
        point : XYZ -> unit
Parameters
faceReference Reference
The geometry reference of face
point XYZ
A point on the face, defining the position of edge to be created.
See Also
Reference
Form Class
AddEdge Overload
Autodesk.Revit.DB Namespace